ToolOpenFoamErrorFacesNotInTriangularOrder/0/U
FoamFile
{
  version  2.0;
  format   ascii;
  class    volVectorField;
  location "0";
  object   U;
}


dimensions [0 1 -1 0 0 0 0];

internalField uniform (0 0 0);

boundaryField
{

inside
{
  type slip;
}

top
{
  type zeroGradient;
}
bottom
{
  type zeroGradient;
}
front
{
  type zeroGradient;
}
back
{
  type zeroGradient;
}
left
{
  type zeroGradient;
}
right
{
  type zeroGradient;
}

}
