ToolOpenFoamErrorFacesNotInTriangularOrder/0/p
FoamFile
{
  version  2.0;
  format   ascii;
  class    volScalarField;
  location "0";
  object   p;
}


dimensions [1 -1 -2 0 0 0 0];

internalField uniform 1.7e5;

boundaryField
{
  top
  {
    type zeroGradient;
  }
  bottom
  {
    type zeroGradient;
  }
  front
  {
    type zeroGradient;
  }
  back
  {
    type zeroGradient;
  }
  left
  {
    type zeroGradient;
  }
  right
  {
    type zeroGradient;
  }
  
  defaultFaces
  {
    type zeroGradient;
  }
}
